---
kind: method
id: M:Autodesk.Revit.DB.DGNImportOptions.#ctor(Autodesk.Revit.DB.DGNImportOptions)
source: html/25841a71-804e-e10d-880e-ebadf80fb0ae.htm
---
# Autodesk.Revit.DB.DGNImportOptions.#ctor Method

Constructs a new instance of DGNImportOptions as a copy of the import options.

## Syntax (C#)
```csharp
public DGNImportOptions(
	DGNImportOptions option
)
```

## Parameters
- **option** (`Autodesk.Revit.DB.DGNImportOptions`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null